; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v8 ?v12)
             (pred_8 ?v9 ?v4)
             (pred_6 ?v8 ?v4)
             (pred_9 ?v6 ?v8 )
	     (pred_11 ?v8)
             (pred_4 ?v7)
             (pred_1 ?v9)
             (pred_2 ?v4)
             (pred_10 ?v8)
             (pred_5 ?v9)
             (pred_12 ?v8)
             (pred_7 ))



(:action op_5
:parameters (?v13 ?v3 ?v11 ?v2)
:precondition (and (pred_4 ?v13) (pred_4 ?v3) (pred_1 ?v11) (pred_2 ?v2)
          (pred_3 ?v13 ?v3) (pred_8 ?v11 ?v2)
                   (pred_6 ?v3 ?v2) (pred_11 ?v13) 
                   (pred_10 ?v3) (pred_5 ?v11))
:effect (and  (pred_12 ?v3) (not (pred_10 ?v3))))


(:action op_1
:parameters (?v13 ?v5)
:precondition (and (pred_4 ?v13) (pred_4 ?v5)
               (pred_11 ?v13) (pred_3 ?v13 ?v5) (pred_12 ?v5))
:effect (and (pred_11 ?v5) (not (pred_11 ?v13))))

(:action op_4
:parameters (?v13 ?v11)
:precondition (and (pred_4 ?v13) (pred_1 ?v11) 
                  (pred_11 ?v13) (pred_9 ?v11 ?v13) (pred_7 ))
:effect (and (pred_5 ?v11)
   (not (pred_9 ?v11 ?v13)) (not (pred_7 ))))


(:action op_3
:parameters (?v13 ?v10 ?v1)
:precondition (and (pred_4 ?v13) (pred_1 ?v10) (pred_1 ?v1)
                  (pred_11 ?v13) (pred_5 ?v1) (pred_9 ?v10 ?v13))
:effect (and (pred_5 ?v10) (pred_9 ?v1 ?v13)
        (not (pred_5 ?v1)) (not (pred_9 ?v10 ?v13))))

(:action op_2
:parameters (?v13 ?v11)
:precondition (and (pred_4 ?v13) (pred_1 ?v11) 
                  (pred_11 ?v13) (pred_5 ?v11))
:effect (and (pred_7 ) (pred_9 ?v11 ?v13) (not (pred_5 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_32 obj_23 obj_22 obj_16 obj_13 obj_29 obj_02 obj_19 obj_11 obj_17 obj_25 obj_24 obj_20 obj_26 obj_01 obj_15 obj_05 obj_30 obj_31 obj_09 obj_12 obj_10 obj_18 obj_06 obj_07
    obj_04 obj_14 obj_28
    obj_21 obj_03 obj_27 obj_08
    )

    (:init
       (pred_7)

       (pred_4 obj_32)
       (pred_4 obj_23)
       (pred_4 obj_22)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_11)
       (pred_4 obj_17)
       (pred_4 obj_25)
       (pred_4 obj_24)
       (pred_4 obj_20)
       (pred_4 obj_26)
       (pred_4 obj_01)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_30)
       (pred_4 obj_31)
       (pred_4 obj_09)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_28)
       (pred_1 obj_21)
       (pred_1 obj_03)
       (pred_1 obj_27)
       (pred_1 obj_08)

       (pred_3 obj_32 obj_29)
       (pred_3 obj_32 obj_23)
       (pred_3 obj_23 obj_02)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_32)
       (pred_3 obj_22 obj_19)
       (pred_3 obj_22 obj_16)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_22)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_29 obj_25)
       (pred_3 obj_29 obj_02)
       (pred_3 obj_29 obj_32)
       (pred_3 obj_02 obj_24)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_02 obj_23)
       (pred_3 obj_02 obj_29)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_22)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_11 obj_26)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_25 obj_24)
       (pred_3 obj_25 obj_29)
       (pred_3 obj_24 obj_05)
       (pred_3 obj_24 obj_20)
       (pred_3 obj_24 obj_02)
       (pred_3 obj_24 obj_25)
       (pred_3 obj_20 obj_30)
       (pred_3 obj_20 obj_26)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_24)
       (pred_3 obj_26 obj_31)
       (pred_3 obj_26 obj_01)
       (pred_3 obj_26 obj_11)
       (pred_3 obj_26 obj_20)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_26)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_05)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_05 obj_24)
       (pred_3 obj_05 obj_15)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_30 obj_31)
       (pred_3 obj_30 obj_20)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_31 obj_06)
       (pred_3 obj_31 obj_09)
       (pred_3 obj_31 obj_26)
       (pred_3 obj_31 obj_30)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_31)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_10 obj_18)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_18 obj_10)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_31)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_07 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_32)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_6  obj_16 obj_04)
       (pred_6  obj_32 obj_14)
       (pred_6  obj_02 obj_28)
       (pred_6  obj_13 obj_14)
       (pred_12 obj_23)
       (pred_12 obj_22)
       (pred_12 obj_29)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_12 obj_25)
       (pred_12 obj_24)
       (pred_12 obj_20)
       (pred_12 obj_26)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_30)
       (pred_12 obj_31)
       (pred_12 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_06)
       (pred_12 obj_07)

       (pred_8  obj_21 obj_04)
       (pred_8  obj_03 obj_14)
       (pred_8  obj_27 obj_28)
       (pred_8  obj_08 obj_28)
       (pred_9 obj_21 obj_01)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_27 obj_26)
       (pred_9 obj_08 obj_31)
       (pred_11 obj_22)
    )

    (:goal (and
       (pred_9 obj_27 obj_18)
       (pred_9 obj_08 obj_26)
    ))
(:constraints
  (always (not (pred_11 obj_30)))
)
)

; plan
1. (op_1 obj_22 obj_19)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_19)
   goals met: 0 of 2
2. (op_1 obj_19 obj_20)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_20)
   goals met: 0 of 2
3. (op_1 obj_20 obj_26)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_26)
   goals met: 0 of 2
4. (op_1 obj_26 obj_31)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_31)
   goals met: 0 of 2
5. (op_4 obj_31 obj_08)
   deleted: (pred_9 obj_08 obj_31) (pred_7)
   added: (pred_5 obj_08)
   goals met: 0 of 2
6. (op_1 obj_31 obj_26)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_26)
   goals met: 0 of 2
7. (op_3 obj_26 obj_27 obj_08)
   deleted: (pred_5 obj_08) (pred_9 obj_27 obj_26)
   added: (pred_5 obj_27) (pred_9 obj_08 obj_26)
   goals met: 1 of 2
8. (op_1 obj_26 obj_31)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_31)
   goals met: 1 of 2
9. (op_1 obj_31 obj_06)
   deleted: (pred_11 obj_31)
   added: (pred_11 obj_06)
   goals met: 1 of 2
10. (op_1 obj_06 obj_18)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_18)
   goals met: 1 of 2
11. (op_3 obj_18 obj_03 obj_27)
   deleted: (pred_5 obj_27) (pred_9 obj_03 obj_18)
   added: (pred_5 obj_03) (pred_9 obj_27 obj_18)
   goals met: 2 of 2
